
int counter = 0;
object lockObj = new object();

Thread t1 = new Thread(Increment); // створення потоку, який виконує метод Increment
Thread t2 = new Thread(Increment); // створення другого потоку, який також виконує метод Increment

t1.Start(); // запуск першого потоку
t2.Start(); // запуск другого потоку

t1.Join(); // основний потік чекатиме завершення t1
t2.Join(); // основний потік чекатиме завершення t2

Console.WriteLine($"The end: counter = {counter}"); // очікуємо, що counter буде 200000
void Increment()
{
    for (int i = 0; i < 100000; i++)
    {
        lock(lockObj) 
        {
            // критична секція = частина коду, яка виконується лише одним потоком у якийсь момент часу
            counter++; // доступ з синхронізацією - лише один потік одночасно може виконувати цей блок коду
        }
    }
    // lock гарантує, що лише один потік одночасно змінює counter. Це запобігає гонці потоків і забезпечує коректне збільшення counter до 200000.
}